ПД_sev/src/Documents/ВыплатаНачислений/ВыплатаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаНачислений</name>
  <registerRecords>AccumulationRegister.Начисления</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Documents/ВыплатаНачислений/ManagerModule.bsl
Функция СоздатьДокументПрограммно(стрПараметры) Экспорт 
	НовыйДокумент = Документы.ВыплатаНачислений.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	//НовыйДокумент.Изменил = стрПараметры.Автор;
	НовыйДокумент.Комментарий = стрПараметры.Комментарий;
	НовыйДокумент.Изменил = стрПараметры.Автор;
	НоваяСтрокаСотрудник = НовыйДокумент.Сотрудники.Добавить();
	НоваяСтрокаСотрудник.Сотрудник = стрПараметры.Сотрудник;
	НоваяСтрокаСотрудник.Комментарий = стрПараметры.Комментарий;
	НоваяСтрокаСотрудник.Сумма = стрПараметры.Сумма;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент.Ссылка;
КонецФункции // СоздатьДокумент()
